I-SYST/EHAL/ARM/Nordic/nRF51/exemples/LMXDisplay_ble/src/LMXDisplayBleMain.c
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


/**@brief Function for handling Service errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void service_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}

/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,  (const uint8_t *)PRODUCT_NAME, strlen(PRODUCT_NAME));
    APP_ERROR_CHECK(err_code);

    err_code = sd_ble_gap_appearance_set(BLE_APPEARANCE_UNKNOWN);
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the Advertising functionality.
 *
 * @details Encodes the required advertising data and passes it to the stack.
 *          Also builds a structure to be passed to the stack when starting advertising.
 */
static void advertising_init(void)
{
    uint32_t      err_code;
    ble_advdata_t advdata;
    ble_advdata_t scanrsp;
    uint8_t       flags = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
    ble_advdata_manuf_data_t data;
    uint64_t		id;

    ble_uuid_t blueio_uuids[] =
    {
        {LMXBLUE_UUID_SERVICE,						g_LmxServ.uuid_type},
    };
    ble_uuid_t std_uuids[] =
    {
//		{BLE_UUID_BATTERY_SERVICE,            		BLE_UUID_TYPE_BLE},
		{BLE_UUID_DEVICE_INFORMATION_SERVICE, 		BLE_UUID_TYPE_BLE}

    };

    id = ((uint64_t)NRF_FICR->DEVICEID[1] << 32) | (uint64_t)NRF_FICR->DEVICEID[0];

    data.company_identifier = 0x2082;
    data.data.p_data = (uint8_t*)&id;
    data.data.size = sizeof(id);

    // Build and set advertising data
    memset(&advdata, 0, sizeof(advdata));

    advdata.name_type               = BLE_ADVDATA_FULL_NAME;
    advdata.include_appearance      = true;
    advdata.flags.size              = sizeof(flags);
    advdata.flags.p_data            = &flags;
    advdata.uuids_complete.uuid_cnt = sizeof(std_uuids) / sizeof(std_uuids[0]);
    advdata.uuids_complete.p_uuids  = std_uuids;

    memset(&scanrsp, 0, sizeof(scanrsp));
    scanrsp.uuids_complete.uuid_cnt = sizeof(blueio_uuids) / sizeof(blueio_uuids[0]);
    scanrsp.uuids_complete.p_uuids  = blueio_uuids;
    scanrsp.p_manuf_specific_data = &data;

    err_code = ble_advdata_set(&advdata, &scanrsp);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing Device Information Service.
 */
static void dis_init(void)
{
    uint32_t         err_code;
    ble_dis_init_t   discfg;

    memset(&discfg, 0, sizeof(discfg));

    ble_srv_ascii_to_utf8(&discfg.manufact_name_str, MANUFACTURER_NAME);

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&discfg.dis_attr_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&discfg.dis_attr_md.write_perm);

    err_code = ble_dis_init(&discfg);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing Battery Service.
 */
static void bas_init(void)
{
    uint32_t       err_code;
    ble_bas_init_t bascfg;

    memset(&bascfg, 0, sizeof(bascfg));

    bascfg.evt_handler          = NULL;
    bascfg.support_notification = true;
    bascfg.p_report_ref         = NULL;
    bascfg.initial_batt_level   = 100;

    BLE_GAP_CONN_SEC_MODE_SET_ENC_NO_MITM(&bascfg.battery_level_char_attr_md.cccd_write_perm);
    BLE_GAP_CONN_SEC_MODE_SET_ENC_NO_MITM(&bascfg.battery_level_char_attr_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&bascfg.battery_level_char_attr_md.write_perm);

    BLE_GAP_CONN_SEC_MODE_SET_ENC_NO_MITM(&bascfg.battery_level_report_read_perm);

    err_code = ble_bas_init(&g_BatServ, &bascfg);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing the security parameters.
 */
static void sec_params_init(void)
{
	g_GAPSecParams.timeout      = SEC_PARAM_TIMEOUT;
	g_GAPSecParams.bond         = SEC_PARAM_BOND;
	g_GAPSecParams.mitm         = SEC_PARAM_MITM;
	g_GAPSecParams.io_caps      = SEC_PARAM_IO_CAPABILITIES;
	g_GAPSecParams.oob          = SEC_PARAM_OOB;
	g_GAPSecParams.min_key_size = SEC_PARAM_MIN_KEY_SIZE;
	g_GAPSecParams.max_key_size = SEC_PARAM_MAX_KEY_SIZE;
}

/**@brief Function for handling a Connection Parameters error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}

/**@brief Function for handling the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module which
 *          are passed to the application.
 *          @note All this function does is to disconnect. This could have been done by simply
 *                setting the disconnect_on_fail config parameter, but instead we use the event
 *                handler mechanism to demonstrate its use.
 *
 * @param[in]   p_evt   Event received from the Connection Parameters Module.
 */
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
    uint32_t err_code;

    if(p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
    {
        err_code = sd_ble_gap_disconnect(g_LmxServ.conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
        APP_ERROR_CHECK(err_code);
    }
}

/**@brief Function for initializing the Connection Parameters module.
 */
static void conn_params_init(void)
{
    uint32_t               err_code;
    ble_conn_params_init_t conparam;

    memset(&conparam, 0, sizeof(conparam));

    conparam.p_conn_params                  = NULL;
    conparam.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
    conparam.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
    conparam.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
    conparam.start_on_notify_cccd_handle    = BLE_GATT_HANDLE_INVALID;
    conparam.disconnect_on_fail             = true;
    conparam.evt_handler                    = on_conn_params_evt;
    conparam.error_handler                  = conn_params_error_handler;

    err_code = ble_conn_params_init(&conparam);
    APP_ERROR_CHECK(err_code);
}

